---
kind: type
id: T:Autodesk.Revit.DB.FilterNumericLessOrEqual
source: html/532a63ec-e8c2-41bc-84ab-a8f44c852873.htm
---
# Autodesk.Revit.DB.FilterNumericLessOrEqual

Tests whether numeric values from the document are less than or equal to a certain value

## Syntax (C#)
```csharp
public class FilterNumericLessOrEqual : FilterNumericRuleEvaluator
```